{
    "external_id": "0009123456789",
    "run_id": "3b1a7ec8-c67c-4570-98af-45fb75064940",
    "result_json": {
        "note": "Problem:\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. Symptoms began 2 hours prior to arrival. Patient has history of hypertension and hyperlipidemia. Initial ECG shows ST-segment elevation in leads II, III, and aVF consistent with inferior STEMI. Troponin I elevated at 15.2 ng/mL (normal <0.04). Patient is hemodynamically unstable with blood pressure 85/50 mmHg and requires immediate intervention.\nGoal:\nProvide emergent cardiac catheterization and percutaneous coronary intervention (PCI) for acute ST-elevation myocardial infarction. Stabilize hemodynamics, prevent further myocardial damage, and initiate appropriate post-MI medical management including dual antiplatelet therapy, beta-blockers, ACE inhibitors, and statin therapy. Monitor for complications including arrhythmias, heart failure, and mechanical complications of MI.\nOutcome:\nPatient admitted to Cardiac Intensive Care Unit for acute STEMI requiring emergent cardiac catheterization. Cardiology consulted and patient taken emergently to cardiac catheterization laboratory. Given severity of presentation, hemodynamic instability, and need for ongoing cardiac monitoring and intervention, patient meets criteria for inpatient admission. Anticipated length of stay 3-5 days pending procedural results and clinical stability. I had the pleasure of seeing John Doe in the University Vein Center today. John is a pleasant 49 y.o. male with a history of symptomatic venous reflux involving the bilateral lower extremities. On 2/28/2025, John underwent radiofrequency ablation of the left great saphenous vein, which was performed by Dr. Jane. John presents today for routine follow-up. Subjective: Since the procedure, John reports experiencing much improvement in prior symptoms of venous reflux. He denies any new leg swelling or pain, there is some tenderness and erythema at the proximal thigh without severe discomforts. There are no reported symptoms concerning for access site paresthesias. He reports consistent wear of thigh high compression, as previously directed. Overall, John is pleased with the outcome of the procedure. John denies any changes to health history, medications, or drug allergies since the last visit. RIGHT leg complications from procedure: N/A- no treatment performed to date on this leg LEFT leg complications from procedure: none Treated vein recanalyzed?: No Hospital admission within 72 hours after outpatient procedure?: no Current living status: home Current anticoagulant: none Patient Reported Symptoms: RIGHT leg: Heaviness: Some of the time Achiness: Some of the time Swelling: Some of the time Throbbing: None of the time Itching: Some of the time Right Leg VVSYMQ Score: 8 Vein appearance: Moderately noticeable Impact of RIGHT leg symptoms on ability to work/perform usual daily activities over the past week: Symptoms but full work/activity LEFT leg: Heaviness: Some of the time Achiness: Some of the time Swelling: A good bit of the time Throbbing: A good bit of the time Itching: Some of the time Left Leg VVSYMQ Score: 12 Vein appearance: Moderately noticeable Impact of LEFT leg symptoms on ability to work/perform usual daily activities over the past week: Symptoms but full work/activity Number of days after procedure before patient could resume work/normal activity: 1 Review of Systems Pertinent items are noted in HPI. Past Medical History: Diagnosis Date Allergy history unknown Asthma Conversion Data - ^Resolved Basal cell carcinoma of right side of nose 10/12/2017 Benign neoplasm of islets of Langerhans 1999 Dysplastic nevus 10/21/2020 right pariental scalp Heart murmur Keloid Melanoma in situ of back 04/26/2017 Other specified disorder of penis Conversion Data - ^Resolved Rectal bleeding Past Surgical History: Procedure Laterality Date ABDOMEN SURGERY bcc right nose 10/2017 CONVERTED PROCEDURE 1999 Distal Pancreatectomy LASIK Right 2008 Corneal LASIK Right PANCREAS SURGERY 2000 SKIN BIOPSY VASECTOMY Family History Problem Relation Age of Onset Cancer Mother lymphoma, mycois fugoides Colon polyps Mother Cancer Father skin cancer High cholesterol Brother Cancer Maternal Grandmother 62 colon Colon cancer Maternal Grandmother Cancer Maternal Grandfather 81 lung Heart Disease Paternal Grandmother Stroke Paternal Grandfather 62 No Known Problems Brother Anesthesia problems Neg Hx Social History Tobacco Use Smoking status: Never Smokeless tobacco: Never Substance Use Topics Alcohol use: Yes Alcohol/week: 1.0 standard drink of alcohol Types: 1 Cans of beer per week Comment: 6 weekly Allergies[1] Current Outpatient Medications Medication albuterol HFA (PROVENTIL, VENTOLIN) 108 (90 Base) MCG/ACT inhaler fluticasone (FLONASE) 50 MCG/ACT nasal spray montelukast (SINGULAIR) 10 mg tablet No current facility-administered medications for this visit. Objective: Physical Exam: BP 135/78 (BP Location: Right arm) | Ht 1.803 m (5' 11) | Wt 74.8 kg (165 lb) | BMI 23.01 kg/m² General appearance: alert, appears stated age, cooperative and no distress Head: Normocephalic, atraumatic Lungs: respirations unlabored Heart: regular rate and rhythm Extremities: Bilateral lower extremities are warm and well perfused without any evidence of clubbing, cyanosis, or limb ischemia. Intact DP and PT pulses. No evidence of venous ulceration, lipodermatosclerosis, or edema. Left medial calf catheter access site is well healed without paresthesia. Neurologic: Grossly normal Pulses: Right Dorsalis Pedis: Normal Left Dorsalis Pedis: Normal Right Posterior Tibial: Normal Left Posterior Tibial: Normal CEAP/VCSS: RIGHT Leg CEAP/VCSS: Class: C2 Etiology: Primary Anatomy: Superficial Pathophysiology: Reflux Pain: Mild (occasional, non-restrictive) Varicose Veins: Moderate (multiple, confined to calf or thigh) Edema: None Pigmentation: None Inflammation: None Induration: None Active Ulcers: None Ulcer Duration: None Largest Diameter: None Compression Rx: Everyday Total: 6 LEFT Leg CEAP/VCSS: Class: C2 Etiology: Primary Anatomy: Superficial Pathophysiology: Reflux Pain: Mild (occasional, non-restrictive) Varicose Veins: Severe (multiple, involve both calf and thigh) Edema: None Pigmentation: None Inflammation: None Induration: None Active Ulcers: None Ulcer Duration: None Largest Diameter: None Compression Rx: Everyday Total: 7 Non-Invasive Studies: Successful closure of the left great saphenous vein is seen by wall thickening and cessation of flow 1.29 cm from the common femoral vein. No evidence of deep venous thrombosis in the left lower extremity. Patent superficial epigastric vein. Assessment: 49 y.o. male s/p left lower extremity radiofrequency ablation. Stable follow-up visit. Plan: John been doing well since left GSV RFA and has experienced improvement in prior symptoms of venous reflux. Duplex imaging completed today was reviewed by myself and shows GSV closed 12mm from the CFV, no EHIT. We discussed continued wear of thigh high compression through 1 week post-procedure at minimum and ongoing travel restriction. John is to be scheduled for further vein treatment in the coming weeks. Questions regarding planned procedure answered; informed consent was previously obtained. He was urged to phone clinic with any questions or concerns prior to next visit. Thank you for the opportunity to participate in John P Doe's care. If we can be of any further assistance to you, please feel free to contact our office. Nurse Name, NP 3/3/2025 [1] Allergies Allergen Reactions No Known Drug Allergy Created by Conversion - 0; Surgeon: John Dane, MD Assistant: Surgery Date: 8/1/2025 Location: Outpatient Vein Center Preoperative Diagnosis: Symptomatic reflux of BILATERAL leg(s). Postoperative Diagnosis: Same as preoperative diagnosis Procedure: RFA of RIGHT great saphenous vein Procedure start time:1:29 Procedure end time:1:44 Indications: Marc P Doe is a 75 y.o. male who presented with signs and symptoms of bilateral lower extremity venous insufficiency. Venous competency duplex confirmed the diagnosis. Treatment was indicated. The patient was informed of the potential risks, complications, benefits and alternatives to the procedure including but not limited to bleeding, infection, DVT, and continued medical management. The patient acknowledged understanding and informed consent was obtained. Procedure: The patient was placed on the procedure table in a supine position. The right lower extremity was prepped and draped in the usual sterile fashion. A 2 patient identifier time out was performed. Under direct ultrasound guidance, the right great saphenous vein was accessed with an arterial entry needle at the level of the calf. A wire was advanced without difficulty. A small incision was made and the needle was exchanged out for a 7F sheath. The radiofrequency ablation probe was advanced to the level of the sapheno-femoral junction and was placed 3.8 cm from the epigastric. Tumescent solution was injected along the length of the vein under ultrasound guidance. The probe was activated and the vein was ablated. Sterile dressing was placed with Steri-strips, guaze and tegederm. The patient tolerated the procedure well. Post-procedure ultrasound documented patent common femoral and epigastric veins. All sponge and instrument counts were correct at the end of the case. I, Jane Dane, MD , was present for the entirety of the procedure. Vascular Quality Initiative - Varicose Vein Treatment Does this vein treatment meet VQI inclusion requirements? Mark “YES” below f this was a percutaneous (closed) or cut-down (open) procedure to ablate or remove superficial truncal veins, perforating veins, or varicose vein clusters in the lower extremity(ies) for treatment of C2 or greater venous disease. Mark 'NO' below if the treatment was performed for deep veins of the lower extremity, for trauma, or for C0 or C1 venous disease. Also mark 'NO' if treatment was performed for Klippel-Trenaunay Syndrome or other venous malformations. . Yes Setting: hospital, outpatient Anesthesia: Local: Lidocaine 1%:5ml and tumescent solution (30ml 1% lidocaine, 30ml 1% lidocaine with epinephrine, 5ml sodium bicarbonate, 1000ml 0.9% Normal Saline): 370 ml Peri-procedural anticoagulation: none _____________________________________________ Vein Number: 1 Side: right Location: Truncal: GSV thigh Largest Diameter: 4.9 mm Ablation Treatment: Thermal, RF. Covidien- Closurefast (Length of vein treated: 56 cm. Tip Length: 8cm. Number of cycles: 7. Total time: 140 seconds.) ________________________________________________ Treatment: If additional veins treated, use Smart Text VQI VEIN MULTIPLE to document each additional vein. Postop Compression Therapy: Stocking. Duration prescribed: seven days. Strength: 20-30 mmHg. Complications: none. I had the pleasure of seeing John P Doe in the University Vein Center today. John is a pleasant 49 y.o. male with a history of symptomatic venous reflux involving the bilateral lower extremities. On 5/2/2025, John underwent radiofrequency ablation of the right great saphenous vein, which was performed by Dr. JaneDane. John presents today for routine follow-up. Subjective: Since the procedure, John reports experiencing some improvement in prior symptoms of venous reflux. He denies any new leg pain, there is some dependent edema of the right calf. There are no reported symptoms concerning for access site paresthesias. He reports consistent wear of thigh high compression, as previously directed. Overall, John is pleased with the outcome of the procedure. John denies any changes to health history, medications, or drug allergies since the last visit. RIGHT leg complications from procedure: none LEFT leg complications from procedure: none Treated vein recanalyzed?: No Hospital admission within 72 hours after outpatient procedure?: no Current living status: home Current anticoagulant: none Patient Reported Symptoms: RIGHT leg: Heaviness: A little of the time Achiness: A little of the time Swelling: A little of the time Throbbing: None of the time Itching: A little of the time Right Leg VVSYMQ Score: 4 Vein appearance: Very noticeable Impact of RIGHT leg symptoms on ability to work/perform usual daily activities over the past week: Symptoms but full work/activity LEFT leg: Heaviness: A little of the time Achiness: A little of the time Swelling: A little of the time Throbbing: None of the time Itching: A little of the time Left Leg VVSYMQ Score: 4 Vein appearance: Slightly noticeable Impact of LEFT leg symptoms on ability to work/perform usual daily activities over the past week: Symptoms but full work/activity Number of days after procedure before patient could resume work/normal activity: 1 Review of Systems Pertinent items are noted in HPI. Past Medical History: Diagnosis Date Allergy history unknown Asthma Conversion Data - ^Resolved Basal cell carcinoma of right side of nose 10/12/2017 Benign neoplasm of islets of Langerhans 1999 Dysplastic nevus 10/21/2020 right pariental scalp Heart murmur Insulinoma Keloid Melanoma in situ of back 04/26/2017 Other specified disorder of penis Conversion Data - ^Resolved Rectal bleeding Past Surgical History: Procedure Laterality Date ABDOMEN SURGERY bcc right nose 10/2017 CONVERTED PROCEDURE 1999 Distal Pancreatectomy LASIK Right 2008 Corneal LASIK Right PANCREAS SURGERY 2000 SKIN BIOPSY VASECTOMY Family History Problem Relation Age of Onset Cancer Mother lymphoma, mycois fugoides Colon polyps Mother Cancer Father skin cancer High cholesterol Brother No Known Problems Brother Cancer Maternal Grandmother 62 colon Colon cancer Maternal Grandmother Cancer Maternal Grandfather 81 lung Heart Disease Paternal Grandmother Stroke Paternal Grandfather 62 Anesthesia problems Neg Hx Social History Tobacco Use Smoking status: Never Smokeless tobacco: Never Substance Use Topics Alcohol use: Yes Alcohol/week: 1.0 standard drink of alcohol Types: 1 Cans of beer per week Comment: 6 weekly Allergies[1] Current Outpatient Medications Medication albuterol HFA (PROVENTIL, VENTOLIN) 108 (90 Base) MCG/ACT inhaler fluticasone (FLONASE) 50 MCG/ACT nasal spray montelukast (SINGULAIR) 10 mg tablet No current facility-administered medications for this visit. Objective: Physical Exam: BP 120/72 (BP Location: Right arm) | Ht 1.778 m (5' '10') | Wt 77.1 kg (170 lb) | BMI 24.39 kg/m² General appearance: alert, appears stated age, cooperative and no distress Head: Normocephalic, atraumatic Lungs: respirations unlabored Heart: regular rate and rhythm Extremities: Bilateral lower extremities are warm and well perfused without any evidence of clubbing, cyanosis, or limb ischemia. Intact DP and PT pulses. No evidence of venous ulceration, lipodermatosclerosis, or edema. Right medial calf catheter access site is well healed without paresthesia. Neurologic: Grossly normal Pulses: Right Dorsalis Pedis: Normal Left Dorsalis Pedis: Normal CEAP/VCSS: RIGHT Leg CEAP/VCSS: Class: C2 Etiology: Primary Anatomy: Superficial Pathophysiology: Reflux Pain: Mild (occasional, non-restrictive) Varicose Veins: Moderate (multiple, confined to calf or thigh) Edema: None Pigmentation: None Inflammation: None Induration: None Active Ulcers: None Ulcer Duration: None Largest Diameter: None Compression Rx: Everyday Total: 6 LEFT Leg CEAP/VCSS: Class: C2 Etiology: Primary Anatomy: Superficial Pathophysiology: Reflux Pain: Mild (occasional, non-restrictive) Varicose Veins: Severe (multiple, involve both calf and thigh) Edema: None Pigmentation: None Inflammation: None Induration: None Active Ulcers: None Ulcer Duration: None Largest Diameter: None Compression Rx: Everyday Total: 7 Non-Invasive Studies: Interpretation Summary History: Right great saphenous radiofrequency ablation Prior: Comp 11/27/24 Successful closure of the right great saphenous vein is seen by wall thickening and cessation of flow 1.95 cm from the common femoral vein. No evidence of deep venous thrombosis in the right lower extremity. Patent superficial epigastric vein. Assessment: 49 y.o. male s/p right lower extremity radiofrequency ablation. Stable follow-up visit. Plan: John been doing well since right GSV RFA and has experienced improvement in prior symptoms of venous reflux. Duplex imaging completed today was reviewed by myself and shows GSV closed 1.95 cm from the CFV, no EHIT. We discussed continued wear of thigh high compression through 1 week post-procedure at minimum and ongoing travel restriction. John is to be scheduled for further vein treatment in the coming weeks. Questions regarding planned procedure answered; informed consent was previously obtained. He was urged to phone clinic with any questions or concerns prior to next visit. Thank you for the opportunity to participate in John P Doe's care. If we can be of any further assistance to you, please feel free to contact our office. Nurse Name, NP 5/6/2025 [1] Allergies Allergen Reactions No Known Drug Allergy Created by Conversion - 0;",
        "last_name": "Dove VII",
        "first_name": "Joe",
        "encounter_id": 9123456789,
        "admission_time": "2025-10-01 19:58:00",
        "DischargeDateKey": "2025-10-05 19:58:00",
        "guideline_report": {
            "guidelines": [
                {
                    "report": "Hemodynamic Instability - Systolic BP\nThis criterion is met. The document states the patient is \"hemodynamically unstable with blood pressure 85/50 mmHg\". A systolic blood pressure of 85 mmHg is less than the guideline's threshold of <90 mmHg. While the document does not explicitly state \"unresponsive to fluid resuscitation\", the overall context of emergent intervention for acute STEMI and explicit mention of hemodynamic instability strongly indicates this criterion is satisfied.",
                    "citations": [
                        "CitationCharLocation(cited_text='Problem:\\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. ', document_index=0, document_title='Detailed Notes', end_char_index=154, start_char_index=0, type='char_location')",
                        "CitationCharLocation(cited_text='Problem:\\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. ', document_index=0, document_title='Detailed Notes', end_char_index=1300, start_char_index=1250, type='char_location')"
                    ],
                    "condition": "CHEST PAIN REQUIRING ADMISSION",
                    "commentary": "Hemodynamic Instability - Respiratory Status\n\nThis criterion is not met. Although   the patient presents with shortness of breath  , the document does not provide specific respiratory rate measurements or SpO2 levels, nor does it mention any requirement for non-invasive ventilation or supplemental oxygen, which are necessary to assess this criterion.\n\nHemodynamic Instability - Respiratory Status\n\nThis criterion is not met. Although   the patient presents with shortness of breath  , the document does not provide specific respiratory rate measurements or SpO2 levels, nor does it mention any requirement for non-invasive ventilation or supplemental oxygen, which are necessary to assess this criterion.\n\nHemodynamic Instability - Respiratory Status\n\nThis criterion is not met. Although   the patient presents with shortness of breath  , the document does not provide specific respiratory rate measurements or SpO2 levels, nor does it mention any requirement for non-invasive ventilation or supplemental oxygen, which are necessary to assess this criterion.",
                    "criterion_met": true,
                    "guideline_number": "1"
                },
                {
                    "report": "Acute Coronary Syndrome (ACS) or Myocardial Injury - Biomarkers\nThis criterion is met. The document states \"Troponin I elevated at 15.2 ng/mL (normal <0.04)\". This value is significantly greater than the 99th percentile upper reference limit (URL) of 0.04 ng/mL and also more than 2x URL (0.08 ng/mL), confirming a high-risk myocardial injury consistent with the guideline. The document does not explicitly state a \"rising pattern\" but the acute presentation with a markedly elevated troponin is indicative of acute myocardial injury.",
                    "citations": [
                    	"CitationCharLocation(cited_text='Problem:\\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. ', document_index=0, document_title='Detailed Notes', end_char_index=2120, start_char_index=2000, type='char_location')"
                    ],
                    "condition": "CHEST PAIN REQUIRING ADMISSION",
                    "commentary": "Acute Coronary Syndrome (ACS) or Myocardial Injury - Risk Scores\n\nThis criterion is not met. The document does not provide any information regarding TIMI, GRACE, or HEART scores, which are required to assess this guideline.\n\nAcute Coronary Syndrome (ACS) or Myocardial Injury - Risk Scores\n\nThis criterion is not met. The document does not provide any information regarding TIMI, GRACE, or HEART scores, which are required to assess this guideline.\n\nAcute Coronary Syndrome (ACS) or Myocardial Injury - Risk Scores\n\nThis criterion is not met. The document does not provide any information regarding TIMI, GRACE, or HEART scores, which are required to assess this guideline.",
                    "criterion_met": true,
                    "guideline_number": "2"
                },
                {
                    "report": "Life-Threatening Non-Cardiac Etiologies\nThis criterion is not met. The document does not mention any findings or diagnoses related to pulmonary embolism, aortic dissection, or tension pneumothorax. The clinical picture is entirely consistent with a cardiac etiology (STEMI).",
                    "citations": [
                    "CitationCharLocation(cited_text='Problem:\\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. ', document_index=0, document_title='Detailed Notes', end_char_index=2120, start_char_index=2000, type='char_location')",
                    "CitationCharLocation(cited_text='Problem:\\n68-year-old male presents to ED with acute onset chest pain radiating to left arm, associated with diaphoresis, nausea, and shortness of breath. ', document_index=0, document_title='Detailed Notes', end_char_index=632, start_char_index=456, type='char_location')"],
                    "condition": "CHEST PAIN REQUIRING ADMISSION",
                    "commentary": "Life-Threatening Non-Cardiac Etiologies\n\nThis criterion is not met. The document does not mention any findings or diagnoses related to pulmonary embolism, aortic dissection, or tension pneumothorax. The clinical presentation is entirely consistent with a cardiac etiology (STEMI).",
                    "criterion_met": false,
                    "guideline_number": "3"
                },
                {
                    "report": "High-Risk Clinical Features - Persistent Symptoms\nThis criterion is met. The document states \"Symptoms began 2 hours prior to arrival\", which is significantly longer than the guideline's threshold of >20 minutes for chest pain. While it does not explicitly state \"unrelieved by nitroglycerin\" or \"recurrent pain despite aspirin, antianginals, and anticoagulation\", the patient's presentation to the emergency department with acute ST-elevation myocardial infarction strongly implies that the pain was persistent and unrelieved by initial measures.",
                    "citations": [],
                    "condition": "CHEST PAIN REQUIRING ADMISSION",
                    "commentary": "High-Risk Clinical Features - Neurologic Compromise\n\nThis criterion is not met. The document does not mention any instances of syncope or near-syncope, which are required to assess this guideline.\n\nHigh-Risk Clinical Features - Neurologic Compromise\n\nThis criterion is not met. The document does not mention any instances of syncope or near-syncope, which are required to assess this guideline.\n\nHigh-Risk Clinical Features - Neurologic Compromise\n\nThis criterion is not met. The document does not mention any instances of syncope or near-syncope, which are required to assess this guideline.",
                    "criterion_met": true,
                    "guideline_number": "4"
                },
                {
                    "report": "High-Risk Comorbidities - Renal Dysfunction\nThis criterion is not met. The document does not provide any information regarding the patient's renal function, such as eGFR or creatinine levels, which are necessary to assess for CKD stage ≥3 or acute kidney injury.",
                    "citations": [],
                    "condition": "CHEST PAIN REQUIRING ADMISSION",
                    "commentary": "High-Risk Comorbidities - Immunocompromised State\n\nThis criterion is not met. The document does not mention any conditions or treatments that would indicate an immunocompromised state, such as active chemotherapy, HIV with low CD4 count, or post-transplant status.\n\nHigh-Risk Comorbidities - Immunocompromised State\n\nThis criterion is not met. The document does not mention any conditions or treatments that would indicate an immunocompromised state, such as active chemotherapy, HIV with low CD4 count, or post-transplant status.\n\nHigh-Risk Comorbidities - Immunocompromised State\n\nThis criterion is not met. The document does not mention any conditions or treatments that would indicate an immunocompromised state, such as active chemotherapy, HIV with low CD4 count, or post-transplant status.",
                    "criterion_met": false,
                    "guideline_number": "5"
                }
            ],
            "statistics": {
                "conditions": [
                    {
                        "name": "CHEST PAIN REQUIRING ADMISSION",
                        "criteria_met": 3,
                        "ai_classification": "in-patient",
                        "in_patient_confidence": "Low"
                    }
                ],
                "overall_criteria_met": 3,
                "in_patient_confidence": "Low",
                "overall_ai_classification": "in-patient"
            },
            "intensity_of_service_report": {
                "intensity_of_service_tier": "A",
                "intensity_of_service_explanation": "The patient is admitted to the Cardiac Intensive Care Unit (CICU) for an acute ST-elevation myocardial infarction (STEMI) and requires emergent cardiac catheterization and percutaneous coronary intervention (PCI). The patient is hemodynamically unstable, necessitating immediate intervention and stabilization. The planned PCI is listed as an inpatient-only procedure on the CMS list, and the overall clinical picture, including CICU admission and hemodynamic instability, strongly indicates the need for the highest level of care."
            }
        },
        "hospital_account_number": "0009123456789"
    },
    "result_state": {
        "state": "Reviewed",
        "action": "Mark as Reviwed",
        "next_fe": 2,
        "next_be": 2,
        "ui_click": false
    },
    "event_id": null,
    "created_at": "2026-01-05T11:47:41.808894-08:00",
    "updated_at": "2026-01-07T10:30:03.012009-08:00",
    "updated_by": "Manohar Chinthala",
    "client_timezone": "US/Pacific"
}